package real.telegramer.message.dictionary;

public enum Text {
    WELCOME("\uD83D\uDE80 *Приветствуем вас в боте проекта «Настоящий Телеграмщик»*\n" +
            "\n" +
            "Здесь вы сможете узнать более подробную информацию о нашей команде, кейсах, услугах, познакомиться с отзывами наших клиентов. Периодически бот будет присылать полезные материалы по бизнесу в Telegram. \n" +
            "\n" +
            "Если есть какие-то сложности, вопросы, на которые вы не нашли ответа, или желание пообщаться лично - оставьте заявку через бота и наш менеджер свяжется с вами в ближайшее время \uD83E\uDD1D" +
            "\n\nP.S. Отправляя сообщения боту, Вы даете [согласие](https://drive.google.com/file/d/142SuBnfAojGYKD-AwpWwlXcKb9aLvvww/view) " +
            "на обработку персональных данных в соответствии с [Политикой конфиденциальности](https://drive.google.com/file/d/1ETlbMoGASu9p7WAFyBOOeyxjxSXufc17/view)."),
    CHOOSE_OPTION("Выберите нужный пункт меню."),
    EDUCATION("Получить информацию об обучение бизнесу в Telegram можно на сайте \uD83D\uDC47"),
    DESIGN("В огромном количестве Телеграм-каналов способен затеряться даже уникальный, проработанный, перспективный проект. " +
            "*Как выделиться среди конкурентов?* \n" +
            "\n" +
            "Лучший способ решения этой задачи – *заказ разработки фирменного стиля канала*. Индивидуальный, запоминающийся дизайн " +
            "формирует положительный образ, само наличие этого элемента айдентики вызывает уважение и доверие.\n" +
            "\n" +
            "*Мы разрабатываем выразительный, продающий, запоминающийся фирменный стиль для любых каналов* \uD83D\uDE80"),
    ORDER_ANSWER("Спасибо, *информация была отправлена*, менеджер свяжется c вами в ближайшее время \uD83E\uDD1D"),
    PROJECTS_BY_KEY("Получить информацию об услуге \"Канал под ключ\" можно на сайте \uD83D\uDC47"),
    ORDER("Выберите предпочтительный способ связи."),
    BOTS("*Увеличение продаж* Вашего бизнеса путём обработки клиентов через Telegram-бота. Разработка проектов *любой сложности* ⚙️"),
    WRITE_ME("\uD83D\uDD8D Постарайтесь как можно конкретнее описать задачу: проблемы, ожидания, идеи, цели."),
    HARD("Мы можем перезвонить *в удобное для вас время* и наш специалист с радостью *поможет составить ТЗ* \uD83E\uDD1D"),
    OK("Для того, чтобы написать нам нажмите на кнопку ниже."),
    RECALL_ME("Чтобы мы могли с вами связаться и ответить на ваши вопросы, отправьте боту следующую информацию:\n" +
            "\n" +
            "- номер телефона \uD83D\uDCF2\n" +
            "- имя, чтобы мы знали, как к вам обратиться \uD83D\uDE0A\n" +
            "- удобное время и дату ⏰"),
    SERVICES("Команда Настоящего Телеграмщика представляет *широкий спектр услуг в мессенджере Telegram.* " +
            "Мы создадим работающий креатив, разработаем продающую воронку, автоматизируем рутинные процессы с помощью ботов, " +
            "поможем вывести канал на новый уровень и заработать.\n\n" +
            "Если у вас возникнут вопросы, наш специалист проведет *бесплатную консультацию* \uD83D\uDC69\u200D\uD83D\uDCBB"),
    OTHER("\n" +
            "◼️ [Копирайтинг](https://telegra.ph/Zapolnite-kanal-postami-kotorye-obespechat-maksimalnuyu-vovlechennost-08-13) \n" +
            "◼️ [Курирование](https://telegra.ph/Kurirovanie-biznesa-v-Telegram-chto-ehto-takoe-i-zachem-nuzhno-08-13) \n" +
            "◼️ [Создание креативов](https://telegra.ph/Sozdanie-kreativov-kak-deshevo-privlech-podpischikov-na-kanal-08-13)\n" +
            "◼️ [Создание лендингов](https://telegra.ph/EHffektivnaya-reklama-s-pomoshchyu-lendinga-08-13)\n" +
            "◼️ [Создание воронки продаж в ботах и каналах](https://telegra.ph/Voronki-prodazh-v-botah-i-kanalah-08-13) \n" +
            "◼️ [Создание рекламных роликов](https://telegra.ph/Sozdanie-prodayushchih-reklamnyh-rolikov-08-13)\n" +
            "◼️ [Исследование рынка и целевой аудитории](https://telegra.ph/Issledovanie-rynka-gotovim-ploshchadku-dlya-prodvizheniya-produkta-08-14)\n" +
            "◼️ [Анализ канала](https://telegra.ph/Analiz-kanala-kogda-i-zachem-on-nuzhen-08-14)\n" +
            "◼️ [Продвижение в Telegram каналах](https://telegra.ph/Prodvizhenie-v-Telegram-kanalah-08-14)\n" +
            "◼️ [Таргетированная реклама](https://telegra.ph/Targetirovannaya-reklama-08-14)\n" +
            "◼️ [Реклама у блогеров](https://telegra.ph/Reklama-u-blogerov-08-14)\n" +
            "◼️ [Чистка канала от ботов](https://telegra.ph/Ochistka-kanala-ot-botov-08-14)\n" +
            "◼️ [Запуск инфопродукта](https://telegra.ph/Zapusk-infoprodukta-08-14)\n"),
    NOT_KNOW("Простите, наш бот еще не умеет отвечать на такой запрос. Мы доработаем :)" +
            "\nНа всякий случай переслали ваш запрос менеджеру."),
    NOTIFICATION_ANONYMOUS("Пользователь без ника оставил следующее сообщение в разделе %s: %s"),
    NOTIFICATION("Пользователь c ником @%s оставил следующее сообщение в разделе %s: %s"),
    UNKNOWN_NOTIFICATION("Пользователь c ником @%s оставил следующее сообщение: %s"),
    UNKNOWN_ANONYMOUS_NOTIFICATION("Пользователь без ника оставил следующее сообщение: %s");

    private final String text;

    Text(String text) {
        this.text = text;
    }

    public String getText() {
        return text;
    }
}
